#include <stdio.h>
#define PI 3.1415926

int main()
{
    // 标识符的命名规则：只能使用字母、数字和下划线，并且数字不能开头
    // 使用运算符运算时，如果左右两侧类型不一致，要先进行转换
    // 变量一般使用小写字母；常量使用大写字母
    int a = +3;
    int b = -a; // 一个等号表示赋值，优先级较低
    // =号的左侧只能是变量
    a = a + 3.2; // 系统将3.2转换为3因为a是整型int，舍弃小数部分
    // a = a + (int)3.2; // 强制类型转换
    // printf("%d %f\n", a, a); // a是整型，%f是浮点型，类型不匹配，编译器会报错
    printf("%d %f\n", a, (float)a); // 强制类型转换，a是整型，(float)a是浮点型，类型匹配
    
    printf("%d %d\n", sizeof(int), sizeof(a));
    // sizeof()参数为类型时，表示该类型在当前环境下占用多少个字节
    // 为变量时，表示给变量实际分配了多少个字节的存储空间 即变量a是int类型，占用4个字节

    a = b == a + 3;//==是比较运算符，优先级高于=，所以先计算b==a+3的结果，再赋值给a
    printf("%d %d\n", a, b);
    //判断条件表达式的结果是true还是false，true为1，false为0

    // =====复合赋值运算符演示： +=、-=、*=、/=、%= ，优先级相等，右结合=====
    int x = 1;
    x += 1;   //等价于 x = x + 1
    x -= 1;   //等价于 x = x - 1
    x *= 1;   //等价于 x = x * 1
    x /= 1;   //等价于 x = x / 1
    x %= 1;   //等价于 x = x % 1

    int y = 2;
    x *= y + 3; //等价于 x = x * (y + 3)
    return 0;
}