#include <stdio.h>
int main()
{
    // >  >=  <  <=  ==  != , 关系运算符
    // 0是假，非0值都是真
    printf("%d %d %d %d\n", 3 >= 2);
    int a = 3 >= 2; // a的值为1
    if('0' - 48)
        printf("Hello\n");
    else
        printf("World.\n");

    // && || ! 逻辑运算符
    // &&并且，所有的条件为真才是真，如果有一个假就为假，停止计算
    // 条件1 && 条件2 && ... && 条件n
    // ||或者，如果有一个条件为真就是真，遇到一个为真时停止计算
    // 条件1 || 条件2 || ... || 条件n
    // !逻辑非，将真的变假，将假的变真

    int year = 2026;
    // 闰年：能被4整除但不能被100整除，或者能被400整除的年份
    if((year % 4 == 0 && year % 100 != 0) || year % 400 == 0)
        printf("%d是闰年！\n", year);
    if(!0)
        printf("真\n");
    else
        printf("假\n");

    // ?: 唯一的一个三目运算符
    // 一般用法 : 条件表达式 ? 表达式1 : 表达式2
    // 当条件表达式为真时，取表达式1的值，否则取表达式2的值
    int b = 3, c;
    if(a > b)
        c = a;
    else
        c = b;
    c = a > b ? a : b;

    a = (1, 2, 3, 4); // 逗号表达式，从左向右运算，最后一个表达式的值作为整个逗号表达式的值
    printf("%d\n", a);
}