#include <stdio.h>

int main()
{
    // 1.逻辑运算符优先级
    // && ＞ || 先算 && 再算 ||
    // 示例：1 || 0 && 0
    // 先计算 0 && 0 = 0
    // 再计算 1 || 0 = 1
    int res1 = 1 || 0 && 0;
    printf("1 || 0 && 0 = %d\n", res1);
    // ||（逻辑或）
    // 1 || 0 = 1
    // 0 || 0 = 0
    printf("1 || 0 = %d\n", 1 || 0);
    printf("0 || 0 = %d\n", 0 || 0);

    // &&（逻辑与）
    // 1 && 1 = 1
    // 1 && 0 = 0
    printf("1 && 1 = %d\n", 1 && 1);
    printf("1 && 0 = %d\n", 1 && 0);

    // 2. if(A) 与 if(!A) 简写
    // if(A)     等价 if(A != 0)  A不为0（为真）就执行
    // if(!A)    等价 if(A == 0)  A等于0则条件成立
    // ! 代表逻辑非，作用是取反
   
    // 3. 判断小写字母
    // 判断小写字母不能只写 ch >= 'a'，必须写成：if (ch >= 'a' && ch <= 'z')
    // 原因：ASCII 在 'z' 之后还有别的字符，只写一边会造成误判
    return 0;
}